const { Client, ActivityType, Events } = require("discord.js");

module.exports = {
    name: Events.ClientReady,
    once: true,
    /**
     * @param {Client} client
     */
    execute(client) {
        client.user.setStatus("dnd");
        client.user.setActivity({
            name: 'Raed ', 
            type: ActivityType.Streaming, 
        });
        
           
console.log(`
██████╗ ██╗   ██╗     ██████╗ ███████╗
██╔══██╗╚██╗ ██╔╝    ██╔════╝ ██╔════╝
██████╔╝ ╚████╔╝     ██║      ███████╗
██╔══██╗  ╚██╔╝      ██║      ╚════██║
██████╔╝   ██║       ╚██████╗ ███████║
╚═════╝    ╚═╝        ╚═════╝ ╚══════╝

      "⚡ System bot Powered by CS ⚡"

  `);
    },
};
